weifengdq/embedded/tc364/0_Board_Test_LwIP_Iperf/Libraries/Infra/Sfr/TC36x/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S32L */
#define IFX_DMU_HP_PROCON_P1_S32L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S33L */
#define IFX_DMU_HP_PROCON_P1_S33L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S33L */
#define IFX_DMU_HP_PROCON_P1_S33L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S33L */
#define IFX_DMU_HP_PROCON_P1_S33L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S34L */
#define IFX_DMU_HP_PROCON_P1_S34L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S34L */
#define IFX_DMU_HP_PROCON_P1_S34L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S34L */
#define IFX_DMU_HP_PROCON_P1_S34L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S35L */
#define IFX_DMU_HP_PROCON_P1_S35L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S35L */
#define IFX_DMU_HP_PROCON_P1_S35L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S35L */
#define IFX_DMU_HP_PROCON_P1_S35L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S36L */
#define IFX_DMU_HP_PROCON_P1_S36L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S36L */
#define IFX_DMU_HP_PROCON_P1_S36L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S36L */
#define IFX_DMU_HP_PROCON_P1_S36L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S37L */
#define IFX_DMU_HP_PROCON_P1_S37L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S37L */
#define IFX_DMU_HP_PROCON_P1_S37L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S37L */
#define IFX_DMU_HP_PROCON_P1_S37L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S38L */
#define IFX_DMU_HP_PROCON_P1_S38L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S38L */
#define IFX_DMU_HP_PROCON_P1_S38L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S38L */
#define IFX_DMU_HP_PROCON_P1_S38L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S39L */
#define IFX_DMU_HP_PROCON_P1_S39L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S39L */
#define IFX_DMU_HP_PROCON_P1_S39L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S39L */
#define IFX_DMU_HP_PROCON_P1_S39L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S40L */
#define IFX_DMU_HP_PROCON_P1_S40L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S40L */
#define IFX_DMU_HP_PROCON_P1_S40L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S40L */
#define IFX_DMU_HP_PROCON_P1_S40L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S41L */
#define IFX_DMU_HP_PROCON_P1_S41L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S41L */
#define IFX_DMU_HP_PROCON_P1_S41L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S41L */
#define IFX_DMU_HP_PROCON_P1_S41L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S42L */
#define IFX_DMU_HP_PROCON_P1_S42L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S42L */
#define IFX_DMU_HP_PROCON_P1_S42L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S42L */
#define IFX_DMU_HP_PROCON_P1_S42L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S43L */
#define IFX_DMU_HP_PROCON_P1_S43L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S43L */
#define IFX_DMU_HP_PROCON_P1_S43L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S43L */
#define IFX_DMU_HP_PROCON_P1_S43L_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S44L */
#define IFX_DMU_HP_PROCON_P1_S44L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S44L */
#define IFX_DMU_HP_PROCON_P1_S44L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S44L */
#define IFX_DMU_HP_PROCON_P1_S44L_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S45L */
#define IFX_DMU_HP_PROCON_P1_S45L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S45L */
#define IFX_DMU_HP_PROCON_P1_S45L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S45L */
#define IFX_DMU_HP_PROCON_P1_S45L_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S46L */
#define IFX_DMU_HP_PROCON_P1_S46L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S46L */
#define IFX_DMU_HP_PROCON_P1_S46L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S46L */
#define IFX_DMU_HP_PROCON_P1_S46L_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S47L */
#define IFX_DMU_HP_PROCON_P1_S47L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S47L */
#define IFX_DMU_HP_PROCON_P1_S47L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S47L */
#define IFX_DMU_HP_PROCON_P1_S47L_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S48L */
#define IFX_DMU_HP_PROCON_P1_S48L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S48L */
#define IFX_DMU_HP_PROCON_P1_S48L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S48L */
#define IFX_DMU_HP_PROCON_P1_S48L_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S49L */
#define IFX_DMU_HP_PROCON_P1_S49L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S49L */
#define IFX_DMU_HP_PROCON_P1_S49L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S49L */
#define IFX_DMU_HP_PROCON_P1_S49L_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S50L */
#define IFX_DMU_HP_PROCON_P1_S50L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S50L */
#define IFX_DMU_HP_PROCON_P1_S50L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S50L */
#define IFX_DMU_HP_PROCON_P1_S50L_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S51L */
#define IFX_DMU_HP_PROCON_P1_S51L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S51L */
#define IFX_DMU_HP_PROCON_P1_S51L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S51L */
#define IFX_DMU_HP_PROCON_P1_S51L_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S52L */
#define IFX_DMU_HP_PROCON_P1_S52L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S52L */
#define IFX_DMU_HP_PROCON_P1_S52L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S52L */
#define IFX_DMU_HP_PROCON_P1_S52L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S53L */
#define IFX_DMU_HP_PROCON_P1_S53L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S53L */
#define IFX_DMU_HP_PROCON_P1_S53L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S53L */
#define IFX_DMU_HP_PROCON_P1_S53L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S54L */
#define IFX_DMU_HP_PROCON_P1_S54L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S54L */
#define IFX_DMU_HP_PROCON_P1_S54L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S54L */
#define IFX_DMU_HP_PROCON_P1_S54L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S55L */
#define IFX_DMU_HP_PROCON_P1_S55L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S55L */
#define IFX_DMU_HP_PROCON_P1_S55L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S55L */
#define IFX_DMU_HP_PROCON_P1_S55L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S56L */
#define IFX_DMU_HP_PROCON_P1_S56L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S56L */
#define IFX_DMU_HP_PROCON_P1_S56L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S56L */
#define IFX_DMU_HP_PROCON_P1_S56L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S57L */
#define IFX_DMU_HP_PROCON_P1_S57L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S57L */
#define IFX_DMU_HP_PROCON_P1_S57L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_P1_Bits.S57L */
#define IFX_DMU_HP_PROCON_P1_S57L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_P1_Bits.S58L */
#define IFX_DMU_HP_PROCON_P1_S58L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_P1_Bits.S58L */
#define IFX_DMU_HP_PROCON_P1_S58L_MSK (0x1u)

