weifengdq/embedded/tc364/0_Board_Test_LwIP_Iperf/Libraries/Infra/Sfr/TC36x/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S112WOP */
#define IFX_DMU_HP_PROCON_WOP3_S112WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S112WOP */
#define IFX_DMU_HP_PROCON_WOP3_S112WOP_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S113WOP */
#define IFX_DMU_HP_PROCON_WOP3_S113WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S113WOP */
#define IFX_DMU_HP_PROCON_WOP3_S113WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S113WOP */
#define IFX_DMU_HP_PROCON_WOP3_S113WOP_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S114WOP */
#define IFX_DMU_HP_PROCON_WOP3_S114WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S114WOP */
#define IFX_DMU_HP_PROCON_WOP3_S114WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S114WOP */
#define IFX_DMU_HP_PROCON_WOP3_S114WOP_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S115WOP */
#define IFX_DMU_HP_PROCON_WOP3_S115WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S115WOP */
#define IFX_DMU_HP_PROCON_WOP3_S115WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S115WOP */
#define IFX_DMU_HP_PROCON_WOP3_S115WOP_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S116WOP */
#define IFX_DMU_HP_PROCON_WOP3_S116WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S116WOP */
#define IFX_DMU_HP_PROCON_WOP3_S116WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S116WOP */
#define IFX_DMU_HP_PROCON_WOP3_S116WOP_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S117WOP */
#define IFX_DMU_HP_PROCON_WOP3_S117WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S117WOP */
#define IFX_DMU_HP_PROCON_WOP3_S117WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S117WOP */
#define IFX_DMU_HP_PROCON_WOP3_S117WOP_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S118WOP */
#define IFX_DMU_HP_PROCON_WOP3_S118WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S118WOP */
#define IFX_DMU_HP_PROCON_WOP3_S118WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S118WOP */
#define IFX_DMU_HP_PROCON_WOP3_S118WOP_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S119WOP */
#define IFX_DMU_HP_PROCON_WOP3_S119WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S119WOP */
#define IFX_DMU_HP_PROCON_WOP3_S119WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S119WOP */
#define IFX_DMU_HP_PROCON_WOP3_S119WOP_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S120WOP */
#define IFX_DMU_HP_PROCON_WOP3_S120WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S120WOP */
#define IFX_DMU_HP_PROCON_WOP3_S120WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S120WOP */
#define IFX_DMU_HP_PROCON_WOP3_S120WOP_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S121WOP */
#define IFX_DMU_HP_PROCON_WOP3_S121WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S121WOP */
#define IFX_DMU_HP_PROCON_WOP3_S121WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S121WOP */
#define IFX_DMU_HP_PROCON_WOP3_S121WOP_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S122WOP */
#define IFX_DMU_HP_PROCON_WOP3_S122WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S122WOP */
#define IFX_DMU_HP_PROCON_WOP3_S122WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S122WOP */
#define IFX_DMU_HP_PROCON_WOP3_S122WOP_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S123WOP */
#define IFX_DMU_HP_PROCON_WOP3_S123WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S123WOP */
#define IFX_DMU_HP_PROCON_WOP3_S123WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S123WOP */
#define IFX_DMU_HP_PROCON_WOP3_S123WOP_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S124WOP */
#define IFX_DMU_HP_PROCON_WOP3_S124WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S124WOP */
#define IFX_DMU_HP_PROCON_WOP3_S124WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S124WOP */
#define IFX_DMU_HP_PROCON_WOP3_S124WOP_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S125WOP */
#define IFX_DMU_HP_PROCON_WOP3_S125WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S125WOP */
#define IFX_DMU_HP_PROCON_WOP3_S125WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S125WOP */
#define IFX_DMU_HP_PROCON_WOP3_S125WOP_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S126WOP */
#define IFX_DMU_HP_PROCON_WOP3_S126WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S126WOP */
#define IFX_DMU_HP_PROCON_WOP3_S126WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S126WOP */
#define IFX_DMU_HP_PROCON_WOP3_S126WOP_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S127WOP */
#define IFX_DMU_HP_PROCON_WOP3_S127WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S127WOP */
#define IFX_DMU_HP_PROCON_WOP3_S127WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S127WOP */
#define IFX_DMU_HP_PROCON_WOP3_S127WOP_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S128WOP */
#define IFX_DMU_HP_PROCON_WOP4_S128WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S128WOP */
#define IFX_DMU_HP_PROCON_WOP4_S128WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S128WOP */
#define IFX_DMU_HP_PROCON_WOP4_S128WOP_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S129WOP */
#define IFX_DMU_HP_PROCON_WOP4_S129WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S129WOP */
#define IFX_DMU_HP_PROCON_WOP4_S129WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S129WOP */
#define IFX_DMU_HP_PROCON_WOP4_S129WOP_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S130WOP */
#define IFX_DMU_HP_PROCON_WOP4_S130WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S130WOP */
#define IFX_DMU_HP_PROCON_WOP4_S130WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S130WOP */
#define IFX_DMU_HP_PROCON_WOP4_S130WOP_OFF (2u)

